In [150]:
import pandas as pd
import numpy as np

### Q1

In [151]:
arr=np.random.randint(1,100,20)
ser=pd.Series(arr)
ser

0     77
1     67
2     49
3     84
4     14
5     31
6     48
7     82
8      4
9     63
10    95
11    47
12    46
13    55
14    58
15    83
16    72
17    96
18    88
19    72
dtype: int32

In [152]:
# 1 - sum
ser.sum()

1231

In [153]:
# 2- min

ser.min()

4

In [154]:
# 3- max

ser.max()

96

In [155]:
# 4 - mean

ser.mean()

61.55

In [156]:
# 5- head

ser.head()

0    77
1    67
2    49
3    84
4    14
dtype: int32

###  Q2

In [157]:
dct={
    'A':[1,2,4,5],
    'B':['learn','with','pw','skills'],
    'c':['data','science','master','class']
}
df=pd.DataFrame(dct)
print(df)

   A       B        c
0  1   learn     data
1  2    with  science
2  4      pw   master
3  5  skills    class

In [158]:
new_idx=[i for i in range(1,2*df.shape[0],2)]

In [159]:
df.reindex(new_idx)

     A       B        c
1  2.0    with  science
3  5.0  skills    class
5  NaN     NaN      NaN
7  NaN     NaN      NaN

### Q3

In [160]:
temp_list=[10, 20, 30, 40, 50]
df=pd.DataFrame(temp_list,columns=['values'])
df

   values
0      10
1      20
2      30
3      40
4      50

In [161]:
def sum_value(df):
    print("sum of first 3 values is :",df['values'][:3].sum())
sum_value(df)

sum of first 3 values is : 60

###  Q4

In [162]:
words=['learn','with','pw','skills']
word_df=pd.DataFrame(words,columns=['text'])
word_df

     text
0   learn
1    with
2      pw
3  skills

In [163]:
def add_col(word_df):
    word_df['word_count']=[len(word_df['text'][i]) for i in range(word_df.shape[0])]
add_col(word_df)

In [164]:
word_df

     text  word_count
0   learn           5
1    with           4
2      pw           2
3  skills           6

###  Q5

In [165]:
word_df

     text  word_count
0   learn           5
1    with           4
2      pw           2
3  skills           6

In [166]:
word_df.size

8

In [167]:
word_df.shape

(4, 2)

#### shape ->> it returns the (number of Rows,number of Columns)

#### size -->> it returns the total number of values in data frame (multiplication of Rows and Columns)

### Q6

In [168]:
pandas.read_excel()

# this is the function to read excel file

NameError: name 'pandas' is not defined

### Q7

In [169]:
mail=['john@student.com','krish@teacher.com','alex@employee.com']
df=pd.DataFrame(mail,columns=['Email'])
df

               Email
0   john@student.com
1  krish@teacher.com
2  alex@employee.com

In [170]:
def add_user(df):
    user=[str(i).split("@")[0] for i in df['Email']]
    df['Username']=user
add_user(df)

In [171]:
df

               Email Username
0   john@student.com     john
1  krish@teacher.com    krish
2  alex@employee.com     alex

### Q8

In [172]:
values=[
    [3,5,1],
    [8,2,7],
    [6,9,4],
    [2,3,5],
    [9,1,2]
]
df=pd.DataFrame(values,columns=["A","B",'C'])
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [173]:
def filter_val(df):
    print(df[(df['A']>5) & (df['B']<10)])
filter_val(df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

###  Q9

In [174]:
value=np.random.randint(1,100,15)
df=pd.DataFrame(value,columns=['values'])
df

    values
0       64
1       38
2       33
3       23
4       95
5       61
6       91
7       86
8       40
9       72
10      38
11      50
12      73
13      53
14      18

In [175]:
def cal(df):
    print("mean : ",df['values'].describe()['mean'])
    print("median: ",df['values'].describe()[4])
    print("standard deviation: ",df['values'].describe()['std'])
cal(df)

mean :  55.666666666666664
median:  38.0
standard deviation:  24.333007173287033

### Q10

In [176]:
date=pd.date_range(start='2024-6-1', end='2024-6-24')
date=[i for i in date]
values=list(np.random.randint(100,500,len(date)))
df1=pd.DataFrame(values,columns=['sales'])
df2=pd.DataFrame(date,columns=['date'])
df=pd.concat([df1,df2],axis=1)
df

    sales       date
0     351 2024-06-01
1     417 2024-06-02
2     196 2024-06-03
3     455 2024-06-04
4     413 2024-06-05
5     249 2024-06-06
6     449 2024-06-07
7     199 2024-06-08
8     343 2024-06-09
9     123 2024-06-10
10    264 2024-06-11
11    179 2024-06-12
12    328 2024-06-13
13    438 2024-06-14
14    456 2024-06-15
15    120 2024-06-16
16    210 2024-06-17
17    417 2024-06-18
18    346 2024-06-19
19    216 2024-06-20
20    267 2024-06-21
21    323 2024-06-22
22    152 2024-06-23
23    488 2024-06-24

In [177]:
def mvng_avg(df):
    df['MovingAverage']=df['sales'].rolling(7).mean()
    return df
mvng_avg(df)

    sales       date  MovingAverage
0     351 2024-06-01            NaN
1     417 2024-06-02            NaN
2     196 2024-06-03            NaN
3     455 2024-06-04            NaN
4     413 2024-06-05            NaN
5     249 2024-06-06            NaN
6     449 2024-06-07     361.428571
7     199 2024-06-08     339.714286
8     343 2024-06-09     329.142857
9     123 2024-06-10     318.714286
10    264 2024-06-11     291.428571
11    179 2024-06-12     258.000000
12    328 2024-06-13     269.285714
13    438 2024-06-14     267.714286
14    456 2024-06-15     304.428571
15    120 2024-06-16     272.571429
16    210 2024-06-17     285.000000
17    417 2024-06-18     306.857143
18    346 2024-06-19     330.714286
19    216 2024-06-20     314.714286
20    267 2024-06-21     290.285714
21    323 2024-06-22     271.285714
22    152 2024-06-23     275.857143
23    488 2024-06-24     315.571429

### Q11

In [178]:
date=pd.date_range(start='2023-01-01',end='2023-01-05')
df=pd.DataFrame(date,columns=['date'])
df

        date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [179]:
import datetime
def week(df):
    df['Weekday']=df['date'].dt.day_name()
week(df)
df

        date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### Q12

In [180]:
date=list(pd.date_range("2022-12-25",periods=100,freq="10h"))
df=pd.DataFrame(date,columns=['date'])
df

                  date
0  2022-12-25 00:00:00
1  2022-12-25 10:00:00
2  2022-12-25 20:00:00
3  2022-12-26 06:00:00
4  2022-12-26 16:00:00
..                 ...
95 2023-02-02 14:00:00
96 2023-02-03 00:00:00
97 2023-02-03 10:00:00
98 2023-02-03 20:00:00
99 2023-02-04 06:00:00

[100 rows x 1 columns]

In [181]:
def filt(df):
    print(df[df['date'].between('2023-01-01','2023-01-31')])
filt(df)

                  date
17 2023-01-01 02:00:00
18 2023-01-01 12:00:00
19 2023-01-01 22:00:00
20 2023-01-02 08:00:00
21 2023-01-02 18:00:00
..                 ...
84 2023-01-29 00:00:00
85 2023-01-29 10:00:00
86 2023-01-29 20:00:00
87 2023-01-30 06:00:00
88 2023-01-30 16:00:00

[72 rows x 1 columns]

###  Q13

#### the first and foremost necessary library that 'pandas' itself